lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54lm20b/wiring_time.c
static uint32_t selectRunningGrtcLfClockSource(void)
{
    // Note: ensureSystemOffLfxoRunning is NOT called here.
    // It is only needed for SYSTEM OFF wake (programSystemOffWakeUs).
    // Calling it here would stop the LFCLK on every delay(), corrupting
    // GRTC timing and making delay() take 10x longer.
    if (lfclkRunningFrom(CLOCK_LFCLK_STAT_SRC_LFXO)) {
        return GRTC_CLKCFG_CLKSEL_LFXO;
    }

    if (!lfclkRunningFrom(CLOCK_LFCLK_STAT_SRC_LFRC)) {
        startLfclkSource(CLOCK_LFCLK_SRC_SRC_LFRC);
        static const uint32_t kQuickLfrcLimit = 10000000UL;
        (void)waitForLfclkStarted(CLOCK_LFCLK_STAT_SRC_LFRC,
                                  kQuickLfrcLimit);
    }

    return lfclkRunningFrom(CLOCK_LFCLK_STAT_SRC_LFRC)
               ? GRTC_CLKCFG_CLKSEL_SystemLFCLK
               : GRTC_CLKCFG_CLKSEL_LFXO;
}

static bool grtcSyscounterReady(NRF_GRTC_Type* grtc)
{
    (void)NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERL;
    __asm volatile("dsb 0xF" ::: "memory");
    const uint32_t high = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH;
    return ((high & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) >>
            GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Pos) ==
           GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Ready;
}

static uint64_t readGrtcCounterPreserveActive(NRF_GRTC_Type* grtc)
{
    const uint32_t active =
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE & GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk;
    const bool restoreActive =
        active == (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive
                   << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
    if (restoreActive) {
        grtc->TASKS_START = GRTC_TASKS_START_TASKS_START_Trigger;
        __asm volatile("dsb 0xF" ::: "memory");
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
        while (!grtcSyscounterReady(grtc)) {
            __NOP();
        }
    }

    uint64_t value = 0ULL;
    bool valid = false;
    for (uint8_t attempt = 0U; attempt < 32U; ++attempt) {
        const uint32_t lo = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERL;
        const uint32_t hi = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH;

        if ((hi & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) != 0U) {
            continue;
        }

        uint32_t high =
            (hi & GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk) >>
            GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos;
        if ((hi & GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk) != 0U) {
            high = (high - 1U) &
                   (GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk >>
                    GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos);
        }
        value = ((uint64_t)high << 32U) | (uint64_t)lo;
        valid = true;
        break;
    }

    if (!valid) {
        const uint32_t lo = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERL;
        const uint32_t hi = NRF54L15_GRTC_SYSCOUNTER(grtc).SYSCOUNTERH;
        uint32_t high =
            (hi & GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk) >>
            GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos;
        if ((hi & GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk) != 0U) {
            high = (high - 1U) &
                   (GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk >>
                    GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos);
        }
        value = ((uint64_t)high << 32U) | (uint64_t)lo;
    }

    if (restoreActive) {
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
    }

    return value;
}

static void busyWaitApproxUs(uint32_t us)
{
    uint32_t cyclesPerUs = SystemCoreClock / 1000000UL;
    if (cyclesPerUs == 0UL) {
        cyclesPerUs = 64UL;
    }

    uint32_t iterations = cyclesPerUs * us;
    if (iterations == 0UL) {
        iterations = 1UL;
    }

    while (iterations-- > 0UL) {
        __NOP();
    }
}

static void ensureGrtcReady(NRF_GRTC_Type* grtc)
{
    grtc->TASKS_START = GRTC_TASKS_START_TASKS_START_Trigger;
    __asm volatile("dsb 0xF" ::: "memory");
    delayMicroseconds(kGrtcStartSettleUs);

    const uint32_t active =
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE & GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk;
    const bool restoreActive =
        active == (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive
                   << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
    if (restoreActive) {
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
    }

    while (!grtcSyscounterReady(grtc)) {
        __NOP();
    }

    if (restoreActive) {
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
    }
}

static uint64_t readGrtcCounterUs(NRF_GRTC_Type* grtc)
{
    return readGrtcCounterPreserveActive(grtc);
}

#if defined(NRF54L15_CLEAN_POWER_LOW)
#ifdef NRF_TRUSTZONE_NONSECURE
#define NRF54L15_CLEAN_GRTC_BASE 0x400E2000UL
#else
#define NRF54L15_CLEAN_GRTC_BASE 0x500E2000UL
#endif
static NRF_GRTC_Type* const g_low_power_grtc =
    (NRF_GRTC_Type*)NRF54L15_CLEAN_GRTC_BASE;
// On XIAO nRF54L15 secure CPUAPP, the Zephyr-derived allowed mask is 0x67
// (channels 0,1,2,5,6). Choose a non-conflicting tickless wake source at
// runtime because BLE background scheduling owns several GRTC compare channels.
// Channel 0 enumerates as allowed but does not reliably wake CPUAPP here, so
// prefer the highest non-BLE channel left in the board-allowed mask.
enum { kLowPowerDelayInvalidChannel = 0xFFU };
static volatile uint8_t g_low_power_delay_fired = 0U;
static volatile uint8_t g_low_power_timebase_initialized = 0U;
static volatile uint8_t g_low_power_micro_delay_active = 0U;
static uint8_t g_low_power_delay_channel = kLowPowerDelayInvalidChannel;
static uint8_t g_low_power_monotonic_origin_valid = 0U;
static uint64_t g_low_power_monotonic_origin_us = 0ULL;
static const uint32_t kLowPowerMicroDelaySleepThresholdUs = 1000UL;

static uint32_t lowPowerAllCcMask(void)
{
    if (GRTC_CC_MaxCount >= 32U) {
        return 0xFFFFFFFFUL;
    }
    return (1UL << GRTC_CC_MaxCount) - 1UL;
}

static uint64_t readLowPowerCounterUs(void)
{
    return readGrtcCounterPreserveActive(g_low_power_grtc);
}

static void lowPowerDisarmDelayWake(void)
{
    if (g_low_power_delay_channel == kLowPowerDelayInvalidChannel) {
        return;
    }
    NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) = (1UL << g_low_power_delay_channel);
    g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
}

static void lowPowerArmDelayWake(uint64_t targetUs)
{
    if (g_low_power_delay_channel == kLowPowerDelayInvalidChannel) {
        return;
    }
    const uint32_t lo = (uint32_t)(targetUs & 0xFFFFFFFFULL);
    const uint32_t hi = (uint32_t)((targetUs >> 32U) & 0xFFFFFUL);

    g_low_power_delay_fired = 0U;
    g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
    g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    g_low_power_grtc->CC[g_low_power_delay_channel].CCL = lo;
    g_low_power_grtc->CC[g_low_power_delay_channel].CCH =
        (hi << GRTC_CC_CCH_CCH_Pos) & GRTC_CC_CCH_CCH_Msk;
    NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
        (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
    NRF54L15_GRTC_INTENSET_REG(g_low_power_grtc) = (1UL << g_low_power_delay_channel);
    g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Enable << GRTC_CC_CCEN_ACTIVE_Pos);
}

static void initLowPowerTimebase(void)
{
    if (g_low_power_timebase_initialized != 0U) {
        return;
    }

