lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54lm20b/wiring_time.c
    for (uint8_t index = 0U; index < GRTC_SYSCOUNTER_MaxCount; ++index) {
        grtc->SYSCOUNTER[index].ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
    }
    __asm volatile("dsb 0xF" ::: "memory");
    grtc->TASKS_STOP = GRTC_TASKS_STOP_TASKS_STOP_Trigger;
    __asm volatile("dsb 0xF" ::: "memory");
    busyWaitApproxUs(kGrtcStartSettleUs);

#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (g_low_power_timebase_initialized != 0U) {
        NVIC_DisableIRQ(kLowPowerTickIrq);
        NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
            (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
        g_low_power_delay_fired = 0U;
        g_low_power_timebase_initialized = 0U;
    }
#endif
}

void nrf54_core_prepare_system_off_wake_timebase(void)
{
    nrf54lm20b_core_prepare_system_off_wake_timebase();
}

static uint32_t systemOffMinimumLatencyUs(void)
{
    return ((((uint32_t)kSystemOffTimeoutLfclk +
              (uint32_t)kSystemOffWakeLeadLfclk) *
             1000000UL) /
            kSystemOffLfclkFrequencyHz) +
           kSystemOffMinimumLatencyGuardUs;
}

static uint32_t clampSystemOffDelayUs(uint32_t delayUs)
{
    const uint32_t minimumLatencyUs = systemOffMinimumLatencyUs();
    if (delayUs < minimumLatencyUs) {
        return minimumLatencyUs;
    }
    return delayUs;
}

static void configureSystemOffWakeSleep(NRF_GRTC_Type* grtc,
                                        uint32_t grtcClockSel)
{
    uint32_t mode = grtc->MODE;
    mode &= ~(GRTC_MODE_AUTOEN_Msk | GRTC_MODE_SYSCOUNTEREN_Msk);
    mode |= (GRTC_MODE_AUTOEN_CpuActive << GRTC_MODE_AUTOEN_Pos);
    mode |= (GRTC_MODE_SYSCOUNTEREN_Disabled << GRTC_MODE_SYSCOUNTEREN_Pos);
    grtc->MODE = mode;
    __asm volatile("dsb 0xF" ::: "memory");

    uint32_t clkcfg = grtc->CLKCFG;
    clkcfg &= ~GRTC_CLKCFG_CLKSEL_Msk;
    clkcfg |= (grtcClockSel << GRTC_CLKCFG_CLKSEL_Pos) &
              GRTC_CLKCFG_CLKSEL_Msk;
    grtc->CLKCFG = clkcfg;

    grtc->TIMEOUT = (((uint32_t)kSystemOffTimeoutLfclk << GRTC_TIMEOUT_VALUE_Pos) &
                     GRTC_TIMEOUT_VALUE_Msk);
    grtc->WAKETIME =
        (((uint32_t)kSystemOffWakeLeadLfclk << GRTC_WAKETIME_VALUE_Pos) &
         GRTC_WAKETIME_VALUE_Msk);

    mode &= ~GRTC_MODE_SYSCOUNTEREN_Msk;
    mode |= (GRTC_MODE_SYSCOUNTEREN_Enabled << GRTC_MODE_SYSCOUNTEREN_Pos);
    grtc->MODE = mode;
    __asm volatile("dsb 0xF" ::: "memory");
}

static void armSystemOffWakeCompare(NRF_GRTC_Type* grtc,
                                    uint8_t wakeChannel,
                                    uint64_t wakeTimestampUs)
{
    grtc->EVENTS_RTCOMPARESYNC = 0U;
    grtc->EVENTS_COMPARE[wakeChannel] = 0U;
    grtc->CC[wakeChannel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    grtc->CC[wakeChannel].CCL =
        (uint32_t)(wakeTimestampUs & 0xFFFFFFFFULL);
    grtc->CC[wakeChannel].CCH =
        ((uint32_t)((wakeTimestampUs >> 32U) & 0xFFFFFULL) <<
         GRTC_CC_CCH_CCH_Pos) &
        GRTC_CC_CCH_CCH_Msk;
    grtc->CC[wakeChannel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Enable << GRTC_CC_CCEN_ACTIVE_Pos);
    NRF54L15_GRTC_INTENSET_REG(grtc) = (1UL << wakeChannel);
    grtc->EVTENSET = (1UL << wakeChannel);
    __asm volatile("dsb 0xF" ::: "memory");
}

typedef enum {
    kSystemOffCompareSynchronized,
    kSystemOffCompareAlreadyFired,
    kSystemOffCompareSyncTimeout
} system_off_compare_sync_t;

static bool anyGrtcCompareEvent(const NRF_GRTC_Type* grtc)
{
    for (uint8_t channel = 0U; channel < GRTC_CC_MaxCount; ++channel) {
        if (grtc->EVENTS_COMPARE[channel] != 0U) {
            return true;
        }
    }
    return false;
}

static system_off_compare_sync_t waitForSystemOffWakeSynchronization(
    NRF_GRTC_Type* grtc)
{
    uint32_t spinLimit = kSystemOffSyncSpinLimit;
    while (spinLimit-- > 0U) {
        if (anyGrtcCompareEvent(grtc)) {
            return kSystemOffCompareAlreadyFired;
        }
        if (grtc->EVENTS_RTCOMPARESYNC != 0U) {
            grtc->EVENTS_RTCOMPARESYNC = 0U;
            return kSystemOffCompareSynchronized;
        }
    }
    return kSystemOffCompareSyncTimeout;
}

typedef enum {
    kSystemOffWakeProgrammed = 0U,
    kSystemOffWakeLfxoFailed = 1U,
    kSystemOffWakeSyncTimedOut = 2U,
    kSystemOffWakeCompareFired = 3U
} system_off_wake_program_status_t;

static system_off_wake_program_status_t programSystemOffWakeUs(uint32_t delayUs)
{
    NRF_GRTC_Type* const grtc = NRF_GRTC;
    delayUs = clampSystemOffDelayUs(delayUs);

    nrf54lm20b_core_prepare_system_off_wake_timebase();
    if (!ensureSystemOffLfxoRunning()) {
        return kSystemOffWakeLfxoFailed;
    }
    configureSystemOffWakeSleep(grtc, GRTC_CLKCFG_CLKSEL_LFXO);

    const uint8_t wakeChannel = systemOffWakeChannel();
    for (uint8_t channel = 0U; channel < GRTC_CC_MaxCount; ++channel) {
        NRF54L15_GRTC_INTENCLR_REG(grtc) = (1UL << channel);
        grtc->EVTENCLR = (1UL << channel);
        grtc->EVENTS_COMPARE[channel] = 0U;
        if (channel != wakeChannel) {
            grtc->CC[channel].CCEN =
                (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        }
    }

    const uint32_t minimumLatencyUs = systemOffMinimumLatencyUs();
    uint32_t wakeDelayUs = delayUs;

    for (uint8_t attempt = 0U; attempt < 2U; ++attempt) {
        ensureGrtcReady(grtc);
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        __asm volatile("dsb 0xF" ::: "memory");
        while (!grtcSyscounterReady(grtc)) {
            __NOP();
        }

        const uint64_t wakeTimestampUs =
            readGrtcCounterUs(grtc) + (uint64_t)wakeDelayUs;
        armSystemOffWakeCompare(grtc, wakeChannel, wakeTimestampUs);
        NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
            (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive <<
             GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
        uint32_t mode = grtc->MODE;
        mode &= ~GRTC_MODE_AUTOEN_Msk;
        mode |= (GRTC_MODE_AUTOEN_Default << GRTC_MODE_AUTOEN_Pos);
        grtc->MODE = mode;
        __asm volatile("dsb 0xF" ::: "memory");

        const system_off_compare_sync_t status =
            waitForSystemOffWakeSynchronization(grtc);
        if (status == kSystemOffCompareSynchronized &&
            grtc->EVENTS_COMPARE[wakeChannel] == 0U) {
            return kSystemOffWakeProgrammed;
        }
        if (status == kSystemOffCompareSyncTimeout) {
            return kSystemOffWakeSyncTimedOut;
        }

