lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54lm20b/wiring_time.c
        grtc->CC[wakeChannel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        grtc->EVENTS_COMPARE[wakeChannel] = 0U;
        if (wakeDelayUs > UINT32_MAX - minimumLatencyUs) {
            return kSystemOffWakeCompareFired;
        }
        wakeDelayUs += minimumLatencyUs;
    }
    return kSystemOffWakeCompareFired;
}

static void abortSystemOffWithReset(void) __attribute__((noreturn));

static void abortSystemOffWithReset(void)
{
    *(volatile uint32_t*)0xE000ED0CUL = 0x05FA0004UL;
    __asm volatile("dsb 0xF" ::: "memory");
    __asm volatile("isb 0xF" ::: "memory");
    while (1) {
        __asm volatile("wfe");
    }
}

static bool runSystemOffQuiesceHook(bool (*hook)(uint32_t))
{
    return hook == 0 || hook(kSystemOffPeripheralSpinLimit);
}

static bool quiesceSystemOffDmaOwners(void)
{
    return runSystemOffQuiesceHook(
               nrf54_core_quiesce_serial_for_system_off) &&
           runSystemOffQuiesceHook(nrf54_core_quiesce_spi_for_system_off) &&
           runSystemOffQuiesceHook(nrf54_core_quiesce_wire_for_system_off) &&
           runSystemOffQuiesceHook(nrf54_core_quiesce_analog_for_system_off) &&
           runSystemOffQuiesceHook(nrf54_hal_quiesce_for_system_off);
}

static bool stopHfxoForSystemOff(void)
{
    const uint32_t state =
        (NRF_CLOCK->XO.STAT & CLOCK_XO_STAT_STATE_Msk) >>
        CLOCK_XO_STAT_STATE_Pos;
    if (state == CLOCK_XO_STAT_STATE_NotRunning) {
        return true;
    }

    NRF_CLOCK->TASKS_XOSTOP = CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Trigger;
    __asm volatile("dsb 0xF" ::: "memory");
    uint32_t spinLimit = kSystemOffHfxoStopSpinLimit;
    while (spinLimit-- > 0U) {
        if (((NRF_CLOCK->XO.STAT & CLOCK_XO_STAT_STATE_Msk) >>
             CLOCK_XO_STAT_STATE_Pos) == CLOCK_XO_STAT_STATE_NotRunning) {
            return true;
        }
    }
    return false;
}

static void enterSystemOffInternal(bool disableRamRetention,
                                   bool timedWake,
                                   uint32_t delayUs) __attribute__((noreturn));

static void enterSystemOffInternal(bool disableRamRetention,
                                   bool timedWake,
                                   uint32_t delayUs)
{
    NRF_POWER->TASKS_LOWPWR = POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger;
    __asm volatile("cpsid i" ::: "memory");

    if (!nrf54lm20b_core_prepare_system_off()) {
        abortSystemOffWithReset();
    }
    if (!quiesceSystemOffDmaOwners()) {
        abortSystemOffWithReset();
    }

    if (timedWake) {
        const system_off_wake_program_status_t wakeStatus =
            programSystemOffWakeUs(delayUs);
        if (wakeStatus != kSystemOffWakeProgrammed) {
            abortSystemOffWithReset();
        }
    } else {
        nrf54lm20b_core_prepare_system_off_wake_timebase();
    }

    if (disableRamRetention) {
        nrf54lm20b_core_disable_system_off_retention();
    }
    if (!stopHfxoForSystemOff()) {
        abortSystemOffWithReset();
    }
    if (timedWake && anyGrtcCompareEvent(NRF_GRTC)) {
        abortSystemOffWithReset();
    }

    *kScbScr = (*kScbScr | kScbScrSleepDeep_Msk) & ~kScbScrSleepOnExit_Msk;
    __asm volatile("dsb 0xF" ::: "memory");
    __asm volatile("isb 0xF" ::: "memory");
    nrf54_core_clear_reset_reason(0xFFFFFFFFUL);
    __asm volatile("dsb 0xF" ::: "memory");
    NRF_REGULATORS->SYSTEMOFF = REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter;
    __asm volatile("dsb 0xF" ::: "memory");
    __asm volatile("isb 0xF" ::: "memory");

    while (1) {
        __asm volatile("wfi");
        if (timedWake && anyGrtcCompareEvent(NRF_GRTC)) {
            abortSystemOffWithReset();
        }
    }
}

void nrf54_core_system_off(uint8_t disableRamRetention)
    __attribute__((noreturn));
void nrf54_core_system_off(uint8_t disableRamRetention)
{
    enterSystemOffInternal(disableRamRetention != 0U, false, 0U);
}

void nrf54_core_system_off_timed_us(uint32_t delayUs,
                                    uint8_t disableRamRetention)
    __attribute__((noreturn));
void nrf54_core_system_off_timed_us(uint32_t delayUs,
                                    uint8_t disableRamRetention)
{
    enterSystemOffInternal(disableRamRetention != 0U, true, delayUs);
}

static void enterTimedSystemOff(bool disableRamRetention, uint32_t delayUs)
    __attribute__((noreturn));

static void enterTimedSystemOff(bool disableRamRetention, uint32_t delayUs)
{
    enterSystemOffInternal(disableRamRetention, true, delayUs);
}

static uint32_t systemOffDelayMsToUs(unsigned long ms)
{
    uint32_t delayMs = (uint32_t)ms;
    if (delayMs > (0xFFFFFFFFUL / 1000UL)) {
        delayMs = 0xFFFFFFFFUL / 1000UL;
    }
    return delayMs * 1000UL;
}

static void enterSystemOffWakeReset(uint32_t delayUs) __attribute__((noreturn));

static void enterSystemOffWakeReset(uint32_t delayUs)
{
    enterSystemOffInternal(true, true, delayUs);
}

void __attribute__((weak)) SysTick_Handler(void)
{
    ++g_millis_ticks;
}

void initSysTick(void)
{
    SystemCoreClockUpdate();

    uint32_t ticks = SystemCoreClock / 1000UL;
    if (ticks == 0UL) {
        ticks = 64000UL;
    }

    SysTick->CTRL = 0;
    SysTick->LOAD = ticks - 1UL;
    SysTick->VAL = 0UL;
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                    SysTick_CTRL_TICKINT_Msk |
                    SysTick_CTRL_ENABLE_Msk;
}

unsigned long millis(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    return (unsigned long)(nrf54lm20b_core_monotonic_time_us() / 1000ULL);
#else
    uint32_t ticks = g_millis_ticks;
    if (ticks == 0U) {
        /* SysTick_Handler not firing - read counter directly with wrap tracking */
        uint32_t load = SysTick->LOAD;
        uint32_t val = SysTick->VAL;
        uint32_t count = load - val;
        static uint32_t s_last = (uint32_t)-1;
        static uint32_t s_ms = 0;
        if (s_last != (uint32_t)-1 && count < s_last) {
            s_ms++; /* one more ms tick */
        }
        s_last = count;
        return s_ms;
    }
    return (unsigned long)ticks;
#endif
}

unsigned long micros(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    return (unsigned long)nrf54lm20b_core_monotonic_time_us();
#else
    uint32_t ms_a;
    uint32_t ms_b;
    uint32_t val;
    uint32_t load;

    do {
        ms_a = g_millis_ticks;
        val = SysTick->VAL;
        ms_b = g_millis_ticks;
    } while (ms_a != ms_b);

    load = SysTick->LOAD + 1UL;
    uint32_t elapsed = load - val;
    uint32_t cycles_per_us = (SystemCoreClock == 0UL) ? 64UL : (SystemCoreClock / 1000000UL);
    if (cycles_per_us == 0UL) {
        cycles_per_us = 64UL;
    }

    return (unsigned long)(ms_a * 1000UL + (elapsed / cycles_per_us));
#endif
}

uint64_t nrf54lm20b_core_monotonic_time_us(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    initLowPowerTimebase();
    const uint64_t nowUs = readLowPowerCounterUs();
    if (g_low_power_monotonic_origin_valid == 0U) {
        g_low_power_monotonic_origin_us = nowUs;
        g_low_power_monotonic_origin_valid = 1U;
        return 0ULL;
    }
    return nowUs - g_low_power_monotonic_origin_us;
#else
    return (uint64_t)micros();
#endif
}

// Compat wrappers: HAL/Bluefruit libraries reference nrf54l15_core_monotonic_*
uint64_t nrf54l15_core_monotonic_time_us(void) {
    return nrf54lm20b_core_monotonic_time_us();
}
uint32_t nrf54l15_core_monotonic_time_ms(void) {
    return nrf54lm20b_core_monotonic_time_ms();
}

uint32_t nrf54lm20b_core_monotonic_time_ms(void)
{
    return (uint32_t)(nrf54lm20b_core_monotonic_time_us() / 1000ULL);
}

void delay(unsigned long ms)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

